PrometheanDesign/SAMR34_DFP/Microchip.SAMR34_DFP/samr34b/include/component/opamp.h
#define OPAMP_OPAMPCTRL2_ENABLE_Pos           _U_(1)                                               /**< (OPAMP_OPAMPCTRL2) Operational Amplifier Enable Position */
#define OPAMP_OPAMPCTRL2_ENABLE_Msk           (_U_(0x1) << OPAMP_OPAMPCTRL2_ENABLE_Pos)            /**< (OPAMP_OPAMPCTRL2) Operational Amplifier Enable Mask */
#define OPAMP_OPAMPCTRL2_ENABLE(value)        (OPAMP_OPAMPCTRL2_ENABLE_Msk & ((value) << OPAMP_OPAMPCTRL2_ENABLE_Pos))
#define OPAMP_OPAMPCTRL2_ANAOUT_Pos           _U_(2)                                               /**< (OPAMP_OPAMPCTRL2) Analog Output Position */
#define OPAMP_OPAMPCTRL2_ANAOUT_Msk           (_U_(0x1) << OPAMP_OPAMPCTRL2_ANAOUT_Pos)            /**< (OPAMP_OPAMPCTRL2) Analog Output Mask */
#define OPAMP_OPAMPCTRL2_ANAOUT(value)        (OPAMP_OPAMPCTRL2_ANAOUT_Msk & ((value) << OPAMP_OPAMPCTRL2_ANAOUT_Pos))
#define OPAMP_OPAMPCTRL2_BIAS_Pos             _U_(3)                                               /**< (OPAMP_OPAMPCTRL2) Bias Selection Position */
#define OPAMP_OPAMPCTRL2_BIAS_Msk             (_U_(0x3) << OPAMP_OPAMPCTRL2_BIAS_Pos)              /**< (OPAMP_OPAMPCTRL2) Bias Selection Mask */
#define OPAMP_OPAMPCTRL2_BIAS(value)          (OPAMP_OPAMPCTRL2_BIAS_Msk & ((value) << OPAMP_OPAMPCTRL2_BIAS_Pos))
#define   OPAMP_OPAMPCTRL2_BIAS_MODE0_Val     _U_(0x0)                                             /**< (OPAMP_OPAMPCTRL2) Minimum current consumption, but the slowest mode  */
#define   OPAMP_OPAMPCTRL2_BIAS_MODE1_Val     _U_(0x1)                                             /**< (OPAMP_OPAMPCTRL2) Low current consumption, slow speed  */
#define   OPAMP_OPAMPCTRL2_BIAS_MODE2_Val     _U_(0x2)                                             /**< (OPAMP_OPAMPCTRL2) High current consumption, fast speed  */
#define   OPAMP_OPAMPCTRL2_BIAS_MODE3_Val     _U_(0x3)                                             /**< (OPAMP_OPAMPCTRL2) Maximum current consumption but the fastest mode  */
#define OPAMP_OPAMPCTRL2_BIAS_MODE0           (OPAMP_OPAMPCTRL2_BIAS_MODE0_Val << OPAMP_OPAMPCTRL2_BIAS_Pos) /**< (OPAMP_OPAMPCTRL2) Minimum current consumption, but the slowest mode Position  */
#define OPAMP_OPAMPCTRL2_BIAS_MODE1           (OPAMP_OPAMPCTRL2_BIAS_MODE1_Val << OPAMP_OPAMPCTRL2_BIAS_Pos) /**< (OPAMP_OPAMPCTRL2) Low current consumption, slow speed Position  */
#define OPAMP_OPAMPCTRL2_BIAS_MODE2           (OPAMP_OPAMPCTRL2_BIAS_MODE2_Val << OPAMP_OPAMPCTRL2_BIAS_Pos) /**< (OPAMP_OPAMPCTRL2) High current consumption, fast speed Position  */
#define OPAMP_OPAMPCTRL2_BIAS_MODE3           (OPAMP_OPAMPCTRL2_BIAS_MODE3_Val << OPAMP_OPAMPCTRL2_BIAS_Pos) /**< (OPAMP_OPAMPCTRL2) Maximum current consumption but the fastest mode Position  */
#define OPAMP_OPAMPCTRL2_RUNSTDBY_Pos         _U_(6)                                               /**< (OPAMP_OPAMPCTRL2) Run in Standby Position */
#define OPAMP_OPAMPCTRL2_RUNSTDBY_Msk         (_U_(0x1) << OPAMP_OPAMPCTRL2_RUNSTDBY_Pos)          /**< (OPAMP_OPAMPCTRL2) Run in Standby Mask */
#define OPAMP_OPAMPCTRL2_RUNSTDBY(value)      (OPAMP_OPAMPCTRL2_RUNSTDBY_Msk & ((value) << OPAMP_OPAMPCTRL2_RUNSTDBY_Pos))
#define OPAMP_OPAMPCTRL2_ONDEMAND_Pos         _U_(7)                                               /**< (OPAMP_OPAMPCTRL2) On Demand Control Position */
#define OPAMP_OPAMPCTRL2_ONDEMAND_Msk         (_U_(0x1) << OPAMP_OPAMPCTRL2_ONDEMAND_Pos)          /**< (OPAMP_OPAMPCTRL2) On Demand Control Mask */
#define OPAMP_OPAMPCTRL2_ONDEMAND(value)      (OPAMP_OPAMPCTRL2_ONDEMAND_Msk & ((value) << OPAMP_OPAMPCTRL2_ONDEMAND_Pos))
#define OPAMP_OPAMPCTRL2_RES2OUT_Pos          _U_(8)                                               /**< (OPAMP_OPAMPCTRL2) Resistor ladder To Output Position */
#define OPAMP_OPAMPCTRL2_RES2OUT_Msk          (_U_(0x1) << OPAMP_OPAMPCTRL2_RES2OUT_Pos)           /**< (OPAMP_OPAMPCTRL2) Resistor ladder To Output Mask */
#define OPAMP_OPAMPCTRL2_RES2OUT(value)       (OPAMP_OPAMPCTRL2_RES2OUT_Msk & ((value) << OPAMP_OPAMPCTRL2_RES2OUT_Pos))
#define OPAMP_OPAMPCTRL2_RES2VCC_Pos          _U_(9)                                               /**< (OPAMP_OPAMPCTRL2) Resistor ladder To VCC Position */
#define OPAMP_OPAMPCTRL2_RES2VCC_Msk          (_U_(0x1) << OPAMP_OPAMPCTRL2_RES2VCC_Pos)           /**< (OPAMP_OPAMPCTRL2) Resistor ladder To VCC Mask */
#define OPAMP_OPAMPCTRL2_RES2VCC(value)       (OPAMP_OPAMPCTRL2_RES2VCC_Msk & ((value) << OPAMP_OPAMPCTRL2_RES2VCC_Pos))
#define OPAMP_OPAMPCTRL2_RES1EN_Pos           _U_(10)                                              /**< (OPAMP_OPAMPCTRL2) Resistor 1 Enable Position */
#define OPAMP_OPAMPCTRL2_RES1EN_Msk           (_U_(0x1) << OPAMP_OPAMPCTRL2_RES1EN_Pos)            /**< (OPAMP_OPAMPCTRL2) Resistor 1 Enable Mask */
#define OPAMP_OPAMPCTRL2_RES1EN(value)        (OPAMP_OPAMPCTRL2_RES1EN_Msk & ((value) << OPAMP_OPAMPCTRL2_RES1EN_Pos))
#define OPAMP_OPAMPCTRL2_RES1MUX_Pos          _U_(11)                                              /**< (OPAMP_OPAMPCTRL2) Resistor 1 Mux Position */
#define OPAMP_OPAMPCTRL2_RES1MUX_Msk          (_U_(0x3) << OPAMP_OPAMPCTRL2_RES1MUX_Pos)           /**< (OPAMP_OPAMPCTRL2) Resistor 1 Mux Mask */
#define OPAMP_OPAMPCTRL2_RES1MUX(value)       (OPAMP_OPAMPCTRL2_RES1MUX_Msk & ((value) << OPAMP_OPAMPCTRL2_RES1MUX_Pos))
#define   OPAMP_OPAMPCTRL2_RES1MUX_OAxPOS_Val _U_(0x0)                                             /**< (OPAMP_OPAMPCTRL2) Positive inout of OPAMPx  */
#define   OPAMP_OPAMPCTRL2_RES1MUX_OAxNEG_Val _U_(0x1)                                             /**< (OPAMP_OPAMPCTRL2) Negative input of OPAMPx  */
#define   OPAMP_OPAMPCTRL2_RES1MUX_OA1OUT_Val _U_(0x2)                                             /**< (OPAMP_OPAMPCTRL2) OPAMP1 output  */
#define   OPAMP_OPAMPCTRL2_RES1MUX_GND_Val    _U_(0x3)                                             /**< (OPAMP_OPAMPCTRL2) Ground  */
#define OPAMP_OPAMPCTRL2_RES1MUX_OAxPOS       (OPAMP_OPAMPCTRL2_RES1MUX_OAxPOS_Val << OPAMP_OPAMPCTRL2_RES1MUX_Pos) /**< (OPAMP_OPAMPCTRL2) Positive inout of OPAMPx Position  */
#define OPAMP_OPAMPCTRL2_RES1MUX_OAxNEG       (OPAMP_OPAMPCTRL2_RES1MUX_OAxNEG_Val << OPAMP_OPAMPCTRL2_RES1MUX_Pos) /**< (OPAMP_OPAMPCTRL2) Negative input of OPAMPx Position  */
#define OPAMP_OPAMPCTRL2_RES1MUX_OA1OUT       (OPAMP_OPAMPCTRL2_RES1MUX_OA1OUT_Val << OPAMP_OPAMPCTRL2_RES1MUX_Pos) /**< (OPAMP_OPAMPCTRL2) OPAMP1 output Position  */
#define OPAMP_OPAMPCTRL2_RES1MUX_GND          (OPAMP_OPAMPCTRL2_RES1MUX_GND_Val << OPAMP_OPAMPCTRL2_RES1MUX_Pos) /**< (OPAMP_OPAMPCTRL2) Ground Position  */
#define OPAMP_OPAMPCTRL2_POTMUX_Pos           _U_(13)                                              /**< (OPAMP_OPAMPCTRL2) Potentiometer Selection Position */
#define OPAMP_OPAMPCTRL2_POTMUX_Msk           (_U_(0x7) << OPAMP_OPAMPCTRL2_POTMUX_Pos)            /**< (OPAMP_OPAMPCTRL2) Potentiometer Selection Mask */
#define OPAMP_OPAMPCTRL2_POTMUX(value)        (OPAMP_OPAMPCTRL2_POTMUX_Msk & ((value) << OPAMP_OPAMPCTRL2_POTMUX_Pos))
#define   OPAMP_OPAMPCTRL2_POTMUX_14R_2R_Val  _U_(0x0)                                             /**< (OPAMP_OPAMPCTRL2) R1 = 14R, R2 = 2R  */
#define   OPAMP_OPAMPCTRL2_POTMUX_12R_4R_Val  _U_(0x1)                                             /**< (OPAMP_OPAMPCTRL2) R1 = 12R, R2 = 4R  */
#define   OPAMP_OPAMPCTRL2_POTMUX_8R_8R_Val   _U_(0x2)                                             /**< (OPAMP_OPAMPCTRL2) R1 = 8R, R2 = 8R  */
#define   OPAMP_OPAMPCTRL2_POTMUX_6R_10R_Val  _U_(0x3)                                             /**< (OPAMP_OPAMPCTRL2) R1 = 6R, R2 = 10R  */
#define   OPAMP_OPAMPCTRL2_POTMUX_4R_12R_Val  _U_(0x4)                                             /**< (OPAMP_OPAMPCTRL2) R1 = 4R, R2 = 12R  */
#define   OPAMP_OPAMPCTRL2_POTMUX_3R_13R_Val  _U_(0x5)                                             /**< (OPAMP_OPAMPCTRL2) R1 = 3R, R2 = 13R  */
#define   OPAMP_OPAMPCTRL2_POTMUX_2R_14R_Val  _U_(0x6)                                             /**< (OPAMP_OPAMPCTRL2) R1 = 2R, R2 = 14R  */
#define   OPAMP_OPAMPCTRL2_POTMUX_R_15R_Val   _U_(0x7)                                             /**< (OPAMP_OPAMPCTRL2) R1 = 1R, R2 = 15R  */
#define OPAMP_OPAMPCTRL2_POTMUX_14R_2R        (OPAMP_OPAMPCTRL2_POTMUX_14R_2R_Val << OPAMP_OPAMPCTRL2_POTMUX_Pos) /**< (OPAMP_OPAMPCTRL2) R1 = 14R, R2 = 2R Position  */
#define OPAMP_OPAMPCTRL2_POTMUX_12R_4R        (OPAMP_OPAMPCTRL2_POTMUX_12R_4R_Val << OPAMP_OPAMPCTRL2_POTMUX_Pos) /**< (OPAMP_OPAMPCTRL2) R1 = 12R, R2 = 4R Position  */
#define OPAMP_OPAMPCTRL2_POTMUX_8R_8R         (OPAMP_OPAMPCTRL2_POTMUX_8R_8R_Val << OPAMP_OPAMPCTRL2_POTMUX_Pos) /**< (OPAMP_OPAMPCTRL2) R1 = 8R, R2 = 8R Position  */
#define OPAMP_OPAMPCTRL2_POTMUX_6R_10R        (OPAMP_OPAMPCTRL2_POTMUX_6R_10R_Val << OPAMP_OPAMPCTRL2_POTMUX_Pos) /**< (OPAMP_OPAMPCTRL2) R1 = 6R, R2 = 10R Position  */
#define OPAMP_OPAMPCTRL2_POTMUX_4R_12R        (OPAMP_OPAMPCTRL2_POTMUX_4R_12R_Val << OPAMP_OPAMPCTRL2_POTMUX_Pos) /**< (OPAMP_OPAMPCTRL2) R1 = 4R, R2 = 12R Position  */
#define OPAMP_OPAMPCTRL2_POTMUX_3R_13R        (OPAMP_OPAMPCTRL2_POTMUX_3R_13R_Val << OPAMP_OPAMPCTRL2_POTMUX_Pos) /**< (OPAMP_OPAMPCTRL2) R1 = 3R, R2 = 13R Position  */
#define OPAMP_OPAMPCTRL2_POTMUX_2R_14R        (OPAMP_OPAMPCTRL2_POTMUX_2R_14R_Val << OPAMP_OPAMPCTRL2_POTMUX_Pos) /**< (OPAMP_OPAMPCTRL2) R1 = 2R, R2 = 14R Position  */
#define OPAMP_OPAMPCTRL2_POTMUX_R_15R         (OPAMP_OPAMPCTRL2_POTMUX_R_15R_Val << OPAMP_OPAMPCTRL2_POTMUX_Pos) /**< (OPAMP_OPAMPCTRL2) R1 = 1R, R2 = 15R Position  */
#define OPAMP_OPAMPCTRL2_MUXPOS_Pos           _U_(16)                                              /**< (OPAMP_OPAMPCTRL2) Positive Input Mux Selection Position */
#define OPAMP_OPAMPCTRL2_MUXPOS_Msk           (_U_(0x7) << OPAMP_OPAMPCTRL2_MUXPOS_Pos)            /**< (OPAMP_OPAMPCTRL2) Positive Input Mux Selection Mask */
#define OPAMP_OPAMPCTRL2_MUXPOS(value)        (OPAMP_OPAMPCTRL2_MUXPOS_Msk & ((value) << OPAMP_OPAMPCTRL2_MUXPOS_Pos))
#define   OPAMP_OPAMPCTRL2_MUXPOS_OA2POS_Val  _U_(0x0)                                             /**< (OPAMP_OPAMPCTRL2) Positive I/O pin  */
#define   OPAMP_OPAMPCTRL2_MUXPOS_OA2TAP_Val  _U_(0x1)                                             /**< (OPAMP_OPAMPCTRL2) Resistor ladder 2 taps  */
#define   OPAMP_OPAMPCTRL2_MUXPOS_OA1OUT_Val  _U_(0x2)                                             /**< (OPAMP_OPAMPCTRL2) OPAMP1 output  */
#define   OPAMP_OPAMPCTRL2_MUXPOS_GND_Val     _U_(0x3)                                             /**< (OPAMP_OPAMPCTRL2) Ground  */
#define   OPAMP_OPAMPCTRL2_MUXPOS_OA0POS_Val  _U_(0x4)                                             /**< (OPAMP_OPAMPCTRL2) Positive I/O pin OPA0  */
#define   OPAMP_OPAMPCTRL2_MUXPOS_OA1POS_Val  _U_(0x5)                                             /**< (OPAMP_OPAMPCTRL2) Positive I/O pin OPA1  */
#define   OPAMP_OPAMPCTRL2_MUXPOS_OA0TAP_Val  _U_(0x6)                                             /**< (OPAMP_OPAMPCTRL2) Resistor ladder 0 taps  */
#define OPAMP_OPAMPCTRL2_MUXPOS_OA2POS        (OPAMP_OPAMPCTRL2_MUXPOS_OA2POS_Val << OPAMP_OPAMPCTRL2_MUXPOS_Pos) /**< (OPAMP_OPAMPCTRL2) Positive I/O pin Position  */
#define OPAMP_OPAMPCTRL2_MUXPOS_OA2TAP        (OPAMP_OPAMPCTRL2_MUXPOS_OA2TAP_Val << OPAMP_OPAMPCTRL2_MUXPOS_Pos) /**< (OPAMP_OPAMPCTRL2) Resistor ladder 2 taps Position  */
#define OPAMP_OPAMPCTRL2_MUXPOS_OA1OUT        (OPAMP_OPAMPCTRL2_MUXPOS_OA1OUT_Val << OPAMP_OPAMPCTRL2_MUXPOS_Pos) /**< (OPAMP_OPAMPCTRL2) OPAMP1 output Position  */
#define OPAMP_OPAMPCTRL2_MUXPOS_GND           (OPAMP_OPAMPCTRL2_MUXPOS_GND_Val << OPAMP_OPAMPCTRL2_MUXPOS_Pos) /**< (OPAMP_OPAMPCTRL2) Ground Position  */
#define OPAMP_OPAMPCTRL2_MUXPOS_OA0POS        (OPAMP_OPAMPCTRL2_MUXPOS_OA0POS_Val << OPAMP_OPAMPCTRL2_MUXPOS_Pos) /**< (OPAMP_OPAMPCTRL2) Positive I/O pin OPA0 Position  */
#define OPAMP_OPAMPCTRL2_MUXPOS_OA1POS        (OPAMP_OPAMPCTRL2_MUXPOS_OA1POS_Val << OPAMP_OPAMPCTRL2_MUXPOS_Pos) /**< (OPAMP_OPAMPCTRL2) Positive I/O pin OPA1 Position  */
#define OPAMP_OPAMPCTRL2_MUXPOS_OA0TAP        (OPAMP_OPAMPCTRL2_MUXPOS_OA0TAP_Val << OPAMP_OPAMPCTRL2_MUXPOS_Pos) /**< (OPAMP_OPAMPCTRL2) Resistor ladder 0 taps Position  */
#define OPAMP_OPAMPCTRL2_MUXNEG_Pos           _U_(20)                                              /**< (OPAMP_OPAMPCTRL2) Negative Input Mux Selection Position */
#define OPAMP_OPAMPCTRL2_MUXNEG_Msk           (_U_(0x7) << OPAMP_OPAMPCTRL2_MUXNEG_Pos)            /**< (OPAMP_OPAMPCTRL2) Negative Input Mux Selection Mask */
#define OPAMP_OPAMPCTRL2_MUXNEG(value)        (OPAMP_OPAMPCTRL2_MUXNEG_Msk & ((value) << OPAMP_OPAMPCTRL2_MUXNEG_Pos))
#define   OPAMP_OPAMPCTRL2_MUXNEG_OA2NEG_Val  _U_(0x0)                                             /**< (OPAMP_OPAMPCTRL2) Negative I/O pin  */
#define   OPAMP_OPAMPCTRL2_MUXNEG_OA2TAP_Val  _U_(0x1)                                             /**< (OPAMP_OPAMPCTRL2) Resistor ladder 2 taps  */
#define   OPAMP_OPAMPCTRL2_MUXNEG_OA2OUT_Val  _U_(0x2)                                             /**< (OPAMP_OPAMPCTRL2) OPAMP2 output  */
#define   OPAMP_OPAMPCTRL2_MUXNEG_OA0NEG_Val  _U_(0x3)                                             /**< (OPAMP_OPAMPCTRL2) Negative I/O pin OPA0  */
#define   OPAMP_OPAMPCTRL2_MUXNEG_OA1NEG_Val  _U_(0x4)                                             /**< (OPAMP_OPAMPCTRL2) Negative I/O pin OPA1  */
#define   OPAMP_OPAMPCTRL2_MUXNEG_DAC_Val     _U_(0x5)                                             /**< (OPAMP_OPAMPCTRL2) DAC output  */
#define OPAMP_OPAMPCTRL2_MUXNEG_OA2NEG        (OPAMP_OPAMPCTRL2_MUXNEG_OA2NEG_Val << OPAMP_OPAMPCTRL2_MUXNEG_Pos) /**< (OPAMP_OPAMPCTRL2) Negative I/O pin Position  */
#define OPAMP_OPAMPCTRL2_MUXNEG_OA2TAP        (OPAMP_OPAMPCTRL2_MUXNEG_OA2TAP_Val << OPAMP_OPAMPCTRL2_MUXNEG_Pos) /**< (OPAMP_OPAMPCTRL2) Resistor ladder 2 taps Position  */
#define OPAMP_OPAMPCTRL2_MUXNEG_OA2OUT        (OPAMP_OPAMPCTRL2_MUXNEG_OA2OUT_Val << OPAMP_OPAMPCTRL2_MUXNEG_Pos) /**< (OPAMP_OPAMPCTRL2) OPAMP2 output Position  */
#define OPAMP_OPAMPCTRL2_MUXNEG_OA0NEG        (OPAMP_OPAMPCTRL2_MUXNEG_OA0NEG_Val << OPAMP_OPAMPCTRL2_MUXNEG_Pos) /**< (OPAMP_OPAMPCTRL2) Negative I/O pin OPA0 Position  */
#define OPAMP_OPAMPCTRL2_MUXNEG_OA1NEG        (OPAMP_OPAMPCTRL2_MUXNEG_OA1NEG_Val << OPAMP_OPAMPCTRL2_MUXNEG_Pos) /**< (OPAMP_OPAMPCTRL2) Negative I/O pin OPA1 Position  */
#define OPAMP_OPAMPCTRL2_MUXNEG_DAC           (OPAMP_OPAMPCTRL2_MUXNEG_DAC_Val << OPAMP_OPAMPCTRL2_MUXNEG_Pos) /**< (OPAMP_OPAMPCTRL2) DAC output Position  */
#define OPAMP_OPAMPCTRL2_Msk                  _U_(0x0077FFDE)                                      /**< (OPAMP_OPAMPCTRL2) Register Mask  */


/** \brief OPAMP register offsets definitions */
#define OPAMP_CTRLA_REG_OFST           (0x00)              /**< (OPAMP_CTRLA) Control A Offset */
#define OPAMP_STATUS_REG_OFST          (0x02)              /**< (OPAMP_STATUS) Status Offset */
#define OPAMP_OPAMPCTRL0_REG_OFST      (0x04)              /**< (OPAMP_OPAMPCTRL0) OPAMP0 Control Offset */
#define OPAMP_OPAMPCTRL1_REG_OFST      (0x08)              /**< (OPAMP_OPAMPCTRL1) OPAMP1 Control Offset */
#define OPAMP_OPAMPCTRL2_REG_OFST      (0x0C)              /**< (OPAMP_OPAMPCTRL2) OPAMP2 Control Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief OPAMP register API structure */
typedef struct
{  /* Operational Amplifier */
  __IO  uint8_t                        OPAMP_CTRLA;        /**< Offset: 0x00 (R/W  8) Control A */
  __I   uint8_t                        Reserved1[0x01];
  __I   uint8_t                        OPAMP_STATUS;       /**< Offset: 0x02 (R/   8) Status */
  __I   uint8_t                        Reserved2[0x01];
  __IO  uint32_t                       OPAMP_OPAMPCTRL0;   /**< Offset: 0x04 (R/W  32) OPAMP0 Control */
  __IO  uint32_t                       OPAMP_OPAMPCTRL1;   /**< Offset: 0x08 (R/W  32) OPAMP1 Control */
  __IO  uint32_t                       OPAMP_OPAMPCTRL2;   /**< Offset: 0x0C (R/W  32) OPAMP2 Control */
} opamp_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAMR34_OPAMP_COMPONENT_H_ */
